dunknowcoding/NiusBurner/niusburner/arduino/mcs51/boards.txt
# NiusBurner 8051 boards (SDCC).
#
# Copyright 2026 dunknowcoding (NiusRobotLab)
# SPDX-License-Identifier: Apache-2.0

at89s52.name=AT89S52 (NiusBurner / USB-ISP)
at89s52.upload.tool=niusburner
at89s52.upload.protocol=hid
at89s52.upload.maximum_size=8192
at89s52.upload.maximum_data_size=256
at89s52.upload.require_upload_port=false
at89s52.build.mcu=at89s52
at89s52.build.f_cpu=11059200L
at89s52.build.board=AT89S52
at89s52.build.core=niusburner
at89s52.build.variant=standard
at89s52.build.nb_board=at89s52
at89s52.build.extra_flags=
